IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dcsm_z1_regs.xml
	<register id="Z1_GRABRAM1R" width="32" page="1" offset="0x20" internal="0" description="Zone 1 Grab RAM Status Register 1">
		<bitfield id="GRAB_RAM0" description="Grab RAM CPU1.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CPU1.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM CPU1.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM CPU1.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU1.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU1.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CPU1.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CPU1.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU1.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU1.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABRAM2R" width="32" page="1" offset="0x22" internal="0" description="Zone 1 Grab RAM Status Register 2">
		<bitfield id="GRAB_RAM0" description="Grab RAM CM.C0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CM.C1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU1TOCM MSGRAM0_L" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU1TOCM MSGRAM0_H" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CMTOCPU1 MSGRAM0_L" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CMTOCPU1 MSGRAM0_H" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU2TOCM MSGRAM0_L" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU2TOCM MSGRAM0_H" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM10" description="Grab RAM CMTOCPU2 MSGRAM0_L" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM11" description="Grab RAM CMTOCPU2 MSGRAM0_H" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM12" description="Grab RAM CPU1TOCPU2 MSGRAM0_L" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM13" description="Grab RAM CPU1TOCPU2 MSGRAM0_H" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM14" description="Grab RAM CPU2TOCPU1 MSGRAM0_L" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM15" description="Grab RAM CPU2TOCPU1 MSGRAM0_H" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABRAM3R" width="32" page="1" offset="0x24" internal="0" description="Zone 1 Grab RAM Status Register 3">
		<bitfield id="GRAB_RAM0" description="Grab RAM CPU2.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CPU2.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM CPU2.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM CPU2.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU2.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU2.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CPU2.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CPU2.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU2.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU2.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT1R" width="32" page="1" offset="0x26" internal="0" description="Zone 1 Execute Only Flash Status Register 1">
		<bitfield id="EXEONLY_CPU1_SECT0" description="Execute-Only Flash Sector 0 in flash CPU1 BANK" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT1" description="Execute-Only Flash Sector 1 in flash CPU1 BANK" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT2" description="Execute-Only Flash Sector 2 in flash CPU1 BANK" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT3" description="Execute-Only Flash Sector 3 in flash CPU1 BANK" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT4" description="Execute-Only Flash Sector 4 in flash CPU1 BANK" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT5" description="Execute-Only Flash Sector 5 in flash CPU1 BANK" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT6" description="Execute-Only Flash Sector 6 in flash CPU1 BANK" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT7" description="Execute-Only Flash Sector 7 in flash CPU1 BANK" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT8" description="Execute-Only Flash Sector 8 in flash CPU1 BANK" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT9" description="Execute-Only Flash Sector 9 in flash CPU1 BANK" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT10" description="Execute-Only Flash Sector 10 in flash CPU1 BANK" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT11" description="Execute-Only Flash Sector 11 in flash CPU1 BANK" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT12" description="Execute-Only Flash Sector 12 in flash CPU1 BANK" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT13" description="Execute-Only Flash Sector 13 in flash CPU1 BANK" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT0" description="Execute-Only Flash Sector 0 in flash CM BANK" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT1" description="Execute-Only Flash Sector 1 in flash CM BANK" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT2" description="Execute-Only Flash Sector 2 in flash CM BANK" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT3" description="Execute-Only Flash Sector 3 in flash CM BANK" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT4" description="Execute-Only Flash Sector 4 in flash CM BANK" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT5" description="Execute-Only Flash Sector 5 in flash CM BANK" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT6" description="Execute-Only Flash Sector 6 in flash CM BANK" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT7" description="Execute-Only Flash Sector 7 in flash CM BANK" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT8" description="Execute-Only Flash Sector 8 in flash CM BANK" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT9" description="Execute-Only Flash Sector 9 in flash CM BANK" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT10" description="Execute-Only Flash Sector 10 in flash CM BANK" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT11" description="Execute-Only Flash Sector 11 in flash CM BANK" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT12" description="Execute-Only Flash Sector 12 in flash CM BANK" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT13" description="Execute-Only Flash Sector 13 in flash CM BANK" begin="29" end="29" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT2R" width="32" page="1" offset="0x28" internal="0" description="Zone 1 Execute Only Flash Status Register 2">
		<bitfield id="EXEONLY_CPU2_SECT0" description="Execute-Only Flash Sector 0 in flash CPU2 BANK" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT1" description="Execute-Only Flash Sector 1 in flash CPU2 BANK" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT2" description="Execute-Only Flash Sector 2 in flash CPU2 BANK" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT3" description="Execute-Only Flash Sector 3 in flash CPU2 BANK" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT4" description="Execute-Only Flash Sector 4 in flash CPU2 BANK" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT5" description="Execute-Only Flash Sector 5 in flash CPU2 BANK" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT6" description="Execute-Only Flash Sector 6 in flash CPU2 BANK" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT7" description="Execute-Only Flash Sector 7 in flash CPU2 BANK" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT8" description="Execute-Only Flash Sector 8 in flash CPU2 BANK" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT9" description="Execute-Only Flash Sector 9 in flash CPU2 BANK" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT10" description="Execute-Only Flash Sector 10 in flash CPU2 BANK" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT11" description="Execute-Only Flash Sector 11 in flash CPU2 BANK" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT12" description="Execute-Only Flash Sector 12 in flash CPU2 BANK" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT13" description="Execute-Only Flash Sector 13 in flash CPU2 BANK" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
