IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dcsm_z1_regs.xml
	<register id="Z1_EXEONLYRAM1R" width="32" page="1" offset="0x2a" internal="0" description="Zone 1 Execute Only RAM Status Register 1">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM CPU1.LS0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM CPU1.LS1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM CPU1.LS2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM CPU1.LS3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM CPU1.LS4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM CPU1.LS5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM CPU1.LS6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM CPU1.LS7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM8" description="Execute-Only RAM CPU1.D0" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM9" description="Execute-Only RAM CPU1.D1" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM16" description="Execute-Only RAM on CM.C0" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM17" description="Execute-Only RAM on CM.C1" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM22" description="Execute-Only RAM CPU2.D1" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM23" description="Execute-Only RAM CPU2.D0" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM24" description="Execute-Only RAM CPU2.LS7" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM25" description="Execute-Only RAM CPU2.LS6" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM26" description="Execute-Only RAM CPU2.LS5" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM27" description="Execute-Only RAM CPU2.LS4" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM28" description="Execute-Only RAM CPU2.LS3" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM29" description="Execute-Only RAM CPU2.LS2" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM30" description="Execute-Only RAM CPU2.LS1" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM31" description="Execute-Only RAM CPU2.LS0" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY0" width="32" page="1" offset="0x2e" internal="0" description="JTAG Unlock Key Register 0">
		<bitfield id="KEY0" description="JTAGKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY1" width="32" page="1" offset="0x30" internal="0" description="JTAG Unlock Key Register 1">
		<bitfield id="KEY1" description="JTAGKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY2" width="32" page="1" offset="0x32" internal="0" description="JTAG Unlock Key Register 2">
		<bitfield id="KEY2" description="JTAGKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY3" width="32" page="1" offset="0x34" internal="0" description="JTAG Unlock Key Register 3">
		<bitfield id="KEY3" description="JTAGKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY0" width="32" page="1" offset="0x36" internal="0" description="Secure Boot CMAC Key Status Register 0">
		<bitfield id="KEY0" description="CMACKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY1" width="32" page="1" offset="0x38" internal="0" description="Secure Boot CMAC Key Status Register 1">
		<bitfield id="KEY1" description="CMACKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY2" width="32" page="1" offset="0x3a" internal="0" description="Secure Boot CMAC Key Status Register 2">
		<bitfield id="KEY2" description="CMACKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY3" width="32" page="1" offset="0x3c" internal="0" description="Secure Boot CMAC Key Status Register 3">
		<bitfield id="KEY3" description="CMACKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
